jurgen-kluft/rlcd/source/lib_display/cpp/databus/databus_ESP32SPIDMA.cpp
#include "lib_display/databus/databus_ESP32SPIDMA.h"

#if defined(ESP32) && (CONFIG_IDF_TARGET_ESP32 || CONFIG_IDF_TARGET_ESP32S2 || CONFIG_IDF_TARGET_ESP32S3 || CONFIG_IDF_TARGET_ESP32C2 || CONFIG_IDF_TARGET_ESP32C3 || CONFIG_IDF_TARGET_ESP32C6 || CONFIG_IDF_TARGET_ESP32H2 || CONFIG_IDF_TARGET_ESP32P4 || \
                       CONFIG_IDF_TARGET_ESP32C5)

/**
 * @brief Arduino_ESP32SPIDMA
 *
 */
Arduino_ESP32SPIDMA::Arduino_ESP32SPIDMA(int8_t dc /* = GFX_NOT_DEFINED */, int8_t cs /* = GFX_NOT_DEFINED */, int8_t sck /* = GFX_NOT_DEFINED */, int8_t mosi /* = GFX_NOT_DEFINED */, int8_t miso /* = GFX_NOT_DEFINED */,
                                         uint8_t spi_num /* = VSPI for ESP32, HSPI for S2 & S3, FSPI for C3 */, bool is_shared_interface /* = true */)
    : _dc(dc)
    , _spi_num(spi_num)
    , _is_shared_interface(is_shared_interface)
{
    #if CONFIG_IDF_TARGET_ESP32
    if (sck == GFX_NOT_DEFINED && miso == GFX_NOT_DEFINED && mosi == GFX_NOT_DEFINED && cs == GFX_NOT_DEFINED)
    {
        _sck  = (_spi_num == VSPI) ? SCK : 14;
        _miso = (_spi_num == VSPI) ? MISO : 12;
        _mosi = (_spi_num == VSPI) ? MOSI : 13;
        _cs   = (_spi_num == VSPI) ? SS : 15;
    }
    else
    {
        _sck  = sck;
        _miso = miso;
        _mosi = mosi;
        _cs   = cs;
    }
    #else
    if (sck == GFX_NOT_DEFINED && miso == GFX_NOT_DEFINED && mosi == GFX_NOT_DEFINED && cs == GFX_NOT_DEFINED)
    {
        _sck  = SCK;
        _miso = MISO;
        _mosi = MOSI;
        _cs   = SS;
    }
    else
    {
        _sck  = sck;
        _miso = miso;
        _mosi = mosi;
        _cs   = cs;
    }
    #endif
}

/**
 * @brief begin
 *
 * @param speed
 * @param dataMode
 * @return true
 * @return false
 */
bool Arduino_ESP32SPIDMA::begin(int32_t speed, int8_t dataMode)
{
    // set SPI parameters
    _speed    = (speed == GFX_NOT_DEFINED) ? SPI_DEFAULT_FREQ : speed;
    _dataMode = (dataMode == GFX_NOT_DEFINED) ? SPI_MODE0 : dataMode;

    // Fix for ESP32 Arduino core 3.3.6+ compatibility
    // Ref: https://github.com/espressif/arduino-esp32/pull/12265
    // Note: _div is not used in DMA mode (speed is passed directly to ESP-IDF driver),
    // so we skip the call entirely for 3.3.6+ to avoid the changed function signature.
    #if !defined(ESP_ARDUINO_VERSION) || (ESP_ARDUINO_VERSION < ESP_ARDUINO_VERSION_VAL(3, 3, 6))
    if (!_div)
    {
        _div = spiFrequencyToClockDiv(_speed);
    }
    #endif

    // set pin mode
    if (_dc != GFX_NOT_DEFINED)
    {
        pinMode(_dc, OUTPUT);
        digitalWrite(_dc, HIGH);  // Data mode
    }
    if (_cs != GFX_NOT_DEFINED)
    {
        pinMode(_cs, OUTPUT);
        digitalWrite(_cs, HIGH);  // disable chip select
    }

    #if (CONFIG_IDF_TARGET_ESP32 || CONFIG_IDF_TARGET_ESP32S2 || CONFIG_IDF_TARGET_ESP32S3 || CONFIG_IDF_TARGET_ESP32C6 || CONFIG_IDF_TARGET_ESP32P4 || CONFIG_IDF_TARGET_ESP32C5)
    // set fastIO variables
    if (_dc >= 32)
    {
        _dcPinMask = digitalPinToBitMask(_dc);
        _dcPortSet = (PORTreg_t)GPIO_OUT1_W1TS_REG;
        _dcPortClr = (PORTreg_t)GPIO_OUT1_W1TC_REG;
    }
    else if (_dc != GFX_NOT_DEFINED)
    {
        _dcPinMask = digitalPinToBitMask(_dc);
        _dcPortSet = (PORTreg_t)GPIO_OUT_W1TS_REG;
        _dcPortClr = (PORTreg_t)GPIO_OUT_W1TC_REG;
    }
    #else
    if (_dc != GFX_NOT_DEFINED)
    {
        _dcPinMask = digitalPinToBitMask(_dc);
        _dcPortSet = (PORTreg_t)GPIO_OUT_W1TS_REG;
        _dcPortClr = (PORTreg_t)GPIO_OUT_W1TC_REG;
    }
    #endif

    #if (CONFIG_IDF_TARGET_ESP32 || CONFIG_IDF_TARGET_ESP32S2 || CONFIG_IDF_TARGET_ESP32S3)
    if (_cs >= 32)
    {
        _csPinMask = digitalPinToBitMask(_cs);
        _csPortSet = (PORTreg_t)GPIO_OUT1_W1TS_REG;
        _csPortClr = (PORTreg_t)GPIO_OUT1_W1TC_REG;
    }
    else if (_cs != GFX_NOT_DEFINED)
    {
        _csPinMask = digitalPinToBitMask(_cs);
        _csPortSet = (PORTreg_t)GPIO_OUT_W1TS_REG;
        _csPortClr = (PORTreg_t)GPIO_OUT_W1TC_REG;
    }
    #else
    if (_cs != GFX_NOT_DEFINED)
    {
        _csPinMask = digitalPinToBitMask(_cs);
        _csPortSet = (PORTreg_t)GPIO_OUT_W1TS_REG;
        _csPortClr = (PORTreg_t)GPIO_OUT_W1TC_REG;
    }
    #endif

    spi_bus_config_t buscfg = {.mosi_io_num     = _mosi,
                               .miso_io_num     = _miso,
                               .sclk_io_num     = _sck,
                               .quadwp_io_num   = -1,
                               .quadhd_io_num   = -1,
                               .data4_io_num    = -1,
                               .data5_io_num    = -1,
                               .data6_io_num    = -1,
                               .data7_io_num    = -1,
                               .max_transfer_sz = (ESP32SPIDMA_MAX_PIXELS_AT_ONCE * 16) + 8,
                               .flags           = SPICOMMON_BUSFLAG_MASTER | SPICOMMON_BUSFLAG_GPIO_PINS,
                               .intr_flags      = 0};
    #if CONFIG_IDF_TARGET_ESP32C3 || CONFIG_IDF_TARGET_ESP32S3
    esp_err_t ret = spi_bus_initialize((spi_host_device_t)_spi_num, &buscfg, ESP32SPIDMA_DMA_CHANNEL);
    #else
    esp_err_t ret = spi_bus_initialize((spi_host_device_t)(_spi_num - 1), &buscfg, ESP32SPIDMA_DMA_CHANNEL);
    #endif
    if (ret != ESP_OK)
    {
        ESP_ERROR_CHECK(ret);
        return false;
    }

    spi_device_interface_config_t devcfg = {.command_bits     = 0,
                                            .address_bits     = 0,
                                            .dummy_bits       = 0,
                                            .mode             = (uint8_t)_dataMode,
                                            .duty_cycle_pos   = 128,
                                            .cs_ena_pretrans  = 0,
                                            .cs_ena_posttrans = 0,
                                            .clock_speed_hz   = _speed,
                                            .input_delay_ns   = 0,
                                            .spics_io_num     = -1,  // avoid use system CS control
                                            .flags            = (_miso < 0) ? (uint32_t)SPI_DEVICE_NO_DUMMY : 0,
                                            .queue_size       = 1,
                                            .pre_cb           = nullptr,
                                            .post_cb          = nullptr};
    #if CONFIG_IDF_TARGET_ESP32C3 || CONFIG_IDF_TARGET_ESP32S3
    ret = spi_bus_add_device((spi_host_device_t)_spi_num, &devcfg, &_handle);
    #else
    ret = spi_bus_add_device((spi_host_device_t)(_spi_num - 1), &devcfg, &_handle);
    #endif
    if (ret != ESP_OK)
    {
        ESP_ERROR_CHECK(ret);
        return false;
    }

