jurgen-kluft/rlcd/source/lib_display/cpp/databus/databus_ESP32SPIDMA.cpp
    if (!_is_shared_interface)
    {
        spi_device_acquire_bus(_handle, portMAX_DELAY);
    }

    memset(&_spi_tran, 0, sizeof(_spi_tran));

    _buffer = (uint8_t *)heap_caps_aligned_alloc(16, ESP32SPIDMA_MAX_PIXELS_AT_ONCE * 2, MALLOC_CAP_DMA);
    if (!_buffer)
    {
        return false;
    }
    _2nd_buffer = (uint8_t *)heap_caps_aligned_alloc(16, ESP32SPIDMA_MAX_PIXELS_AT_ONCE * 2, MALLOC_CAP_DMA);
    if (!_2nd_buffer)
    {
        return false;
    }

    return true;
}

/**
 * @brief beginWrite
 *
 */
void Arduino_ESP32SPIDMA::beginWrite()
{
    _data_buf_bit_idx = 0;
    _buffer[0]        = 0;

    if (_is_shared_interface)
    {
        spi_device_acquire_bus(_handle, portMAX_DELAY);
    }

    if (_dc != GFX_NOT_DEFINED)
    {
        DC_HIGH();
    }
    CS_LOW();
}

/**
 * @brief endWrite
 *
 */
void Arduino_ESP32SPIDMA::endWrite()
{
    if (_data_buf_bit_idx > 0)
    {
        flush_data_buf();
    }

    if (_is_shared_interface)
    {
        spi_device_release_bus(_handle);
    }

    CS_HIGH();
}

/**
 * @brief writeCommand
 *
 * @param c
 */
void Arduino_ESP32SPIDMA::writeCommand(uint8_t c)
{
    if (_dc == GFX_NOT_DEFINED)  // 9-bit SPI
    {
        WRITE9BIT(c);
    }
    else
    {
        if (_data_buf_bit_idx > 0)
        {
            flush_data_buf();
        }

        DC_LOW();

        _spi_tran.length     = 8;
        _spi_tran.tx_data[0] = c;
        _spi_tran.flags      = SPI_TRANS_USE_TXDATA;

        POLL_START();
        POLL_END();

        DC_HIGH();
    }
}

/**
 * @brief writeCommand16
 *
 * @param c
 */
void Arduino_ESP32SPIDMA::writeCommand16(uint16_t c)
{
    if (_dc == GFX_NOT_DEFINED)  // 9-bit SPI
    {
        _data16.value = c;
        WRITE9BIT(_data16.msb);
        WRITE9BIT(_data16.lsb);
    }
    else
    {
        if (_data_buf_bit_idx > 0)
        {
            flush_data_buf();
        }

        DC_LOW();

        _spi_tran.length = 16;
        MSB_16_SET(_spi_tran.tx_data[0], c);
        _spi_tran.flags = SPI_TRANS_USE_TXDATA;

        POLL_START();
        POLL_END();

        DC_HIGH();
    }
}

/**
 * @brief
 *
 * @param data
 * @param len
 */
void Arduino_ESP32SPIDMA::writeCommandBytes(uint8_t *data, uint32_t len)
{
    if (_dc == GFX_NOT_DEFINED)  // 9-bit SPI
    {
        while (len--)
        {
            WRITE9BIT(*data++);
        }
    }
    else
    {
        DC_LOW();
        while (len--)
        {
            WRITE8BIT(*data++);
        }
        DC_HIGH();
    }
}

/**
 * @brief write
 *
 * @param d
 */
void Arduino_ESP32SPIDMA::write(uint8_t d)
{
    if (_dc == GFX_NOT_DEFINED)  // 9-bit SPI
    {
        WRITE9BIT(0x100 | d);
    }
    else
    {
        WRITE8BIT(d);
    }
}

/**
 * @brief write16
 *
 * @param d
 */
void Arduino_ESP32SPIDMA::write16(uint16_t d)
{
    _data16.value = d;
    if (_dc == GFX_NOT_DEFINED)  // 9-bit SPI
    {
        WRITE9BIT(0x100 | _data16.msb);
        WRITE9BIT(0x100 | _data16.lsb);
    }
    else
    {
        WRITE8BIT(_data16.msb);
        WRITE8BIT(_data16.lsb);
    }
}

/**
 * @brief writeC8D8
 *
 * @param c
 * @param d
 */
void Arduino_ESP32SPIDMA::writeC8D8(uint8_t c, uint8_t d)
{
    if (_dc == GFX_NOT_DEFINED)  // 9-bit SPI
    {
        WRITE9BIT(c);
        WRITE9BIT(0x100 | d);
    }
    else
    {
        if (_data_buf_bit_idx > 0)
        {
            flush_data_buf();
        }

        DC_LOW();

        _spi_tran.length     = 8;
        _spi_tran.tx_data[0] = c;
        _spi_tran.flags      = SPI_TRANS_USE_TXDATA;

        POLL_START();
        POLL_END();

        DC_HIGH();

        _spi_tran.length     = 8;
        _spi_tran.tx_data[0] = d;
        _spi_tran.flags      = SPI_TRANS_USE_TXDATA;

        POLL_START();
        POLL_END();
    }
}

/**
 * @brief writeC8D16
 *
 * @param c
 * @param d
 */
void Arduino_ESP32SPIDMA::writeC8D16(uint8_t c, uint16_t d)
{
    if (_dc == GFX_NOT_DEFINED)  // 9-bit SPI
    {
        WRITE9BIT(c);
        _data16.value = d;
        WRITE9BIT(0x100 | _data16.msb);
        WRITE9BIT(0x100 | _data16.lsb);
    }
    else
    {
        if (_data_buf_bit_idx > 0)
        {
            flush_data_buf();
        }

        DC_LOW();

        _spi_tran.length     = 8;
        _spi_tran.tx_data[0] = c;
        _spi_tran.flags      = SPI_TRANS_USE_TXDATA;

        POLL_START();
        POLL_END();

        DC_HIGH();

        _spi_tran.length     = 16;
        _spi_tran.tx_data[0] = (d >> 8);
        _spi_tran.tx_data[1] = (d & 0xff);
        _spi_tran.flags      = SPI_TRANS_USE_TXDATA;

        POLL_START();
        POLL_END();
    }
}

/**
 * @brief writeC8D16D16
 *
 * @param c
 * @param d1
 * @param d2
 */
void Arduino_ESP32SPIDMA::writeC8D16D16(uint8_t c, uint16_t d1, uint16_t d2)
{
    if (_dc == GFX_NOT_DEFINED)  // 9-bit SPI
    {
        WRITE9BIT(c);
        _data16.value = d1;
        WRITE9BIT(0x100 | _data16.msb);
        WRITE9BIT(0x100 | _data16.lsb);
        _data16.value = d2;
        WRITE9BIT(0x100 | _data16.msb);
        WRITE9BIT(0x100 | _data16.lsb);
    }
    else
    {
        if (_data_buf_bit_idx > 0)
        {
            flush_data_buf();
        }

        DC_LOW();

        _spi_tran.length     = 8;
        _spi_tran.tx_data[0] = c;
        _spi_tran.flags      = SPI_TRANS_USE_TXDATA;

        POLL_START();
        POLL_END();

        DC_HIGH();

        _spi_tran.length     = 32;
        _spi_tran.tx_data[0] = (d1 >> 8);
        _spi_tran.tx_data[1] = (d1 & 0xff);
        _spi_tran.tx_data[2] = (d2 >> 8);
        _spi_tran.tx_data[3] = (d2 & 0xff);
        _spi_tran.flags      = SPI_TRANS_USE_TXDATA;

        POLL_START();
        POLL_END();
    }
}

/**
 * @brief writeRepeat
 *
 * @param p
 * @param len
 */
void Arduino_ESP32SPIDMA::writeRepeat(uint16_t p, uint32_t len)
{
    if (_data_buf_bit_idx > 0)
    {
        flush_data_buf();
    }

    if (_dc == GFX_NOT_DEFINED)  // 9-bit SPI
    {
        _data16.value = p;
        uint32_t hi   = 0x100 | _data16.msb;
        uint32_t lo   = 0x100 | _data16.lsb;
        uint16_t idx;
        uint8_t  shift;
        uint16_t bufLen = (len <= 28) ? len : 28;
        int16_t  xferLen;
        for (uint32_t t = 0; t < bufLen; t++)
        {
            idx   = _data_buf_bit_idx >> 3;
            shift = (_data_buf_bit_idx % 8);
            if (shift)
            {
                _buffer[idx++] |= hi >> (shift + 1);
                _buffer[idx] = hi << (7 - shift);
            }
            else
            {
                _buffer[idx++] = hi >> 1;
                _buffer[idx]   = hi << 7;
            }
            _data_buf_bit_idx += 9;

            idx   = _data_buf_bit_idx >> 3;
            shift = (_data_buf_bit_idx % 8);
            if (shift)
            {
                _buffer[idx++] |= lo >> (shift + 1);
                _buffer[idx] = lo << (7 - shift);
            }
            else
            {
                _buffer[idx++] = lo >> 1;
                _buffer[idx]   = lo << 7;
            }
            _data_buf_bit_idx += 9;
        }

