jurgen-kluft/rlcd/source/lib_display/cpp/databus/databus_ESP32SPIDMA.cpp
        // Issue pixels in blocks from temp buffer
        while (len)  // While pixels remain
        {
            xferLen           = (bufLen < len) ? bufLen : len;  // How many this pass?
            _data_buf_bit_idx = xferLen * 18;

            _spi_tran.tx_buffer = _buffer32;
            _spi_tran.length    = _data_buf_bit_idx;
            _spi_tran.flags     = 0;

            POLL_START();
            POLL_END();

            len -= xferLen;
        }
    }
    else  // 8-bit SPI
    {
        uint16_t bufLen = (len >= ESP32SPIDMA_MAX_PIXELS_AT_ONCE) ? ESP32SPIDMA_MAX_PIXELS_AT_ONCE : len;
        int16_t  xferLen, l;
        uint32_t c32;
        MSB_32_16_16_SET(c32, p, p);

        l = (bufLen + 1) / 2;
        for (uint32_t i = 0; i < l; i++)
        {
            _buffer32[i] = c32;
        }

        // Issue pixels in blocks from temp buffer
        while (len)  // While pixels remain
        {
            xferLen = (bufLen <= len) ? bufLen : len;  // How many this pass?

            _spi_tran.tx_buffer = _buffer32;
            _spi_tran.length    = xferLen << 4;
            _spi_tran.flags     = 0;

            POLL_START();
            POLL_END();

            len -= xferLen;
        }
    }

    _data_buf_bit_idx = 0;
}

/**
 * @brief writePixels
 *
 * @param data
 * @param len
 */
void Arduino_ESP32SPIDMA::writePixels(uint16_t *data, uint32_t len)
{
    if (_dc == GFX_NOT_DEFINED)  // 9-bit SPI
    {
        while (len--)
        {
            write16(*data++);
        }
    }
    else  // 8-bit SPI
    {
        if (_data_buf_bit_idx > 0)
        {
            flush_data_buf();
        }

        uint32_t l, l2;
        uint16_t p1, p2;
        while (len)
        {
            l  = (len > ESP32SPIDMA_MAX_PIXELS_AT_ONCE) ? ESP32SPIDMA_MAX_PIXELS_AT_ONCE : len;
            l2 = (l + 1) >> 1;
            for (uint32_t i = 0; i < l2; ++i)
            {
                p1 = *data++;
                p2 = *data++;
                MSB_32_16_16_SET(_buffer32[i], p1, p2);
            }
            if (l & 1)
            {
                p1 = *data++;
                MSB_16_SET(_buffer16[l - 1], p1);
            }

            _spi_tran.tx_buffer = _buffer32;
            _spi_tran.length    = l << 4;
            _spi_tran.flags     = 0;

            POLL_START();
            POLL_END();

            len -= l;
        }
    }
}

/**
 * @brief writeBytes
 *
 * @param data
 * @param len
 */
void Arduino_ESP32SPIDMA::writeBytes(uint8_t *data, uint32_t len)
{
    if (_dc == GFX_NOT_DEFINED)  // 9-bit SPI
    {
        while (len--)
        {
            write(*data++);
        }
    }
    else  // 8-bit SPI
    {
        if (esp_ptr_dma_capable(data))
        {
            if (_data_buf_bit_idx > 0)
            {
                flush_data_buf();
            }

            uint32_t l;
            while (len)
            {
                l = (len >= (ESP32SPIDMA_MAX_PIXELS_AT_ONCE << 1)) ? (ESP32SPIDMA_MAX_PIXELS_AT_ONCE << 1) : len;

                _spi_tran.tx_buffer = data;
                _spi_tran.length    = l << 3;
                _spi_tran.flags     = 0;

                POLL_START();
                POLL_END();

                len -= l;
                data += l;
            }
        }
        else
        {
            if (_data_buf_bit_idx > 0)
            {
                flush_data_buf();
            }

            uint32_t  l, l4;
            uint32_t *p;
            while (len)
            {
                l  = (len > (ESP32SPIDMA_MAX_PIXELS_AT_ONCE << 1)) ? (ESP32SPIDMA_MAX_PIXELS_AT_ONCE << 1) : len;
                l4 = (l + 3) >> 2;
                p  = (uint32_t *)data;
                for (uint32_t i = 0; i < l4; ++i)
                {
                    _buffer32[i] = *p++;
                }

                _spi_tran.tx_buffer = _buffer32;
                _spi_tran.length    = l << 3;
                _spi_tran.flags     = 0;

                POLL_START();
                POLL_END();

                len -= l;
                data += l;
            }
        }
    }
}

/**
 * @brief writeIndexedPixels
 *
 * @param data
 * @param idx
 * @param len
 */
void Arduino_ESP32SPIDMA::writeIndexedPixels(uint8_t *data, uint16_t *idx, uint32_t len)
{
    if (_dc == GFX_NOT_DEFINED)  // 9-bit SPI
    {
        while (len--)
        {
            write16(idx[*data++]);
        }
    }
    else  // 8-bit SPI
    {
        if (_data_buf_bit_idx > 0)
        {
            flush_data_buf();
        }

        uint32_t l, l2;
        uint16_t p1, p2;
        while (len)
        {
            l  = (len > ESP32SPIDMA_MAX_PIXELS_AT_ONCE) ? ESP32SPIDMA_MAX_PIXELS_AT_ONCE : len;
            l2 = l >> 1;
            for (uint32_t i = 0; i < l2; ++i)
            {
                p1 = idx[*data++];
                p2 = idx[*data++];
                MSB_32_16_16_SET(_buffer32[i], p1, p2);
            }
            if (l & 1)
            {
                p1 = idx[*data++];
                MSB_16_SET(_buffer16[l - 1], p1);
            }

            _spi_tran.tx_buffer = _buffer32;
            _spi_tran.length    = l << 4;
            _spi_tran.flags     = 0;

            POLL_START();
            POLL_END();

            len -= l;
        }
    }
}

/**
 * @brief writeIndexedPixelsDouble
 *
 * @param data
 * @param idx
 * @param len
 */
void Arduino_ESP32SPIDMA::writeIndexedPixelsDouble(uint8_t *data, uint16_t *idx, uint32_t len)
{
    if (_dc == GFX_NOT_DEFINED)  // 9-bit SPI
    {
        uint16_t hi, lo;
        while (len--)
        {
            _data16.value = idx[*data++];
            hi            = 0x100 | _data16.msb;
            lo            = 0x100 | _data16.lsb;
            WRITE9BIT(hi);
            WRITE9BIT(lo);
            WRITE9BIT(hi);
            WRITE9BIT(lo);
        }
    }
    else  // 8-bit SPI
    {
        if (_data_buf_bit_idx > 0)
        {
            flush_data_buf();
        }

        uint32_t l;
        uint16_t p;
        while (len)
        {
            l = (len > (ESP32SPIDMA_MAX_PIXELS_AT_ONCE >> 1)) ? (ESP32SPIDMA_MAX_PIXELS_AT_ONCE >> 1) : len;
            for (uint32_t i = 0; i < l; ++i)
            {
                p = idx[*data++];
                MSB_32_16_16_SET(_buffer32[i], p, p);
            }

            _spi_tran.tx_buffer = _buffer32;
            _spi_tran.length    = l << 5;
            _spi_tran.flags     = 0;

            POLL_START();
            POLL_END();

            len -= l;
        }
    }
}

void Arduino_ESP32SPIDMA::writeYCbCrPixels(uint8_t *yData, uint8_t *cbData, uint8_t *crData, uint16_t w, uint16_t h)
{
    if (w > (ESP32SPIDMA_MAX_PIXELS_AT_ONCE / 2))
    {
        Arduino_DataBus::writeYCbCrPixels(yData, cbData, crData, w, h);
    }
    else
    {
        int       cols   = w >> 1;
        int       rows   = h >> 1;
        uint8_t  *yData2 = yData + w;
        uint16_t *dest   = _buffer16;
        uint16_t *dest2  = dest + w;

        uint8_t pxCb, pxCr;
        int16_t pxR, pxG, pxB, pxY;

        uint16_t out_bits     = w << 5;
        bool     poll_started = false;
        for (int row = 0; row < rows; ++row)
        {
            for (int col = 0; col < cols; ++col)
            {
                pxCb = *cbData++;
                pxCr = *crData++;
                pxR  = CR2R16[pxCr];
                pxG  = -CB2G16[pxCb] - CR2G16[pxCr];
                pxB  = CB2B16[pxCb];

                pxY      = Y2I16[*yData++];
                *dest++  = CLIPRBE[pxY + pxR] | CLIPGBE[pxY + pxG] | CLIPBBE[pxY + pxB];
                pxY      = Y2I16[*yData++];
                *dest++  = CLIPRBE[pxY + pxR] | CLIPGBE[pxY + pxG] | CLIPBBE[pxY + pxB];
                pxY      = Y2I16[*yData2++];
                *dest2++ = CLIPRBE[pxY + pxR] | CLIPGBE[pxY + pxG] | CLIPBBE[pxY + pxB];
                pxY      = Y2I16[*yData2++];
                *dest2++ = CLIPRBE[pxY + pxR] | CLIPGBE[pxY + pxG] | CLIPBBE[pxY + pxB];
            }
            yData += w;
            yData2 += w;

            if (poll_started)
            {
                POLL_END();
            }
            else
            {
                poll_started = true;
            }
            if (row & 1)
            {
                _spi_tran.tx_buffer = _2nd_buffer32;
                dest                = _buffer16;
            }
            else
            {
                _spi_tran.tx_buffer = _buffer32;
                dest                = _2nd_buffer16;
            }
            _spi_tran.length = out_bits;
            _spi_tran.flags  = 0;

            POLL_START();
            dest2 = dest + w;
        }

