jurgen-kluft/rlcd/source/lib_display/cpp/databus/databus_ESP32SPIDMA.cpp
        POLL_END();
    }
}

/**
 * @brief flush_data_buf
 *
 */
void Arduino_ESP32SPIDMA::flush_data_buf()
{
    _spi_tran.tx_buffer = _buffer32;
    _spi_tran.length    = _data_buf_bit_idx;
    _spi_tran.flags     = 0;

    POLL_START();
    POLL_END();

    _data_buf_bit_idx = 0;
}

/**
 * @brief WRITE8BIT
 *
 * @param d
 * @return GFX_INLINE
 */
GFX_INLINE void Arduino_ESP32SPIDMA::WRITE8BIT(uint8_t d)
{
    uint16_t idx = _data_buf_bit_idx >> 3;
    _buffer[idx] = d;
    _data_buf_bit_idx += 8;
    if (_data_buf_bit_idx >= (ESP32SPIDMA_MAX_PIXELS_AT_ONCE << 4))
    {
        flush_data_buf();
    }
}

/**
 * @brief WRITE9BIT
 *
 * @param d
 * @return GFX_INLINE
 */
GFX_INLINE void Arduino_ESP32SPIDMA::WRITE9BIT(uint32_t d)
{
    uint16_t idx   = _data_buf_bit_idx >> 3;
    uint8_t  shift = (_data_buf_bit_idx % 8);
    if (shift)
    {
        _buffer[idx++] |= d >> (shift + 1);
        _buffer[idx] = d << (7 - shift);
    }
    else
    {
        _buffer[idx++] = d >> 1;
        _buffer[idx]   = d << 7;
    }
    _data_buf_bit_idx += 9;
    if (_data_buf_bit_idx >= 504)  // 56 bytes * 9 bits
    {
        flush_data_buf();
    }
}

/******** low level bit twiddling **********/

/**
 * @brief DC_HIGH
 *
 * @return GFX_INLINE
 */
GFX_INLINE void Arduino_ESP32SPIDMA::DC_HIGH(void) { *_dcPortSet = _dcPinMask; }

/**
 * @brief DC_LOW
 *
 * @return GFX_INLINE
 */
GFX_INLINE void Arduino_ESP32SPIDMA::DC_LOW(void) { *_dcPortClr = _dcPinMask; }

/**
 * @brief CS_HIGH
 *
 * @return GFX_INLINE
 */
GFX_INLINE void Arduino_ESP32SPIDMA::CS_HIGH(void)
{
    if (_cs != GFX_NOT_DEFINED)
    {
        *_csPortSet = _csPinMask;
    }
}

/**
 * @brief CS_LOW
 *
 * @return GFX_INLINE
 */
GFX_INLINE void Arduino_ESP32SPIDMA::CS_LOW(void)
{
    if (_cs != GFX_NOT_DEFINED)
    {
        *_csPortClr = _csPinMask;
    }
}

/**
 * @brief POLL_START
 *
 * @return GFX_INLINE
 */
GFX_INLINE void Arduino_ESP32SPIDMA::POLL_START() { spi_device_polling_start(_handle, &_spi_tran, portMAX_DELAY); }

/**
 * @brief POLL_END
 *
 * @return GFX_INLINE
 */
GFX_INLINE void Arduino_ESP32SPIDMA::POLL_END() { spi_device_polling_end(_handle, portMAX_DELAY); }

#endif  // #if defined(ESP32) && (CONFIG_IDF_TARGET_ESP32 || CONFIG_IDF_TARGET_ESP32S2 || CONFIG_IDF_TARGET_ESP32S3 || CONFIG_IDF_TARGET_ESP32C2 || CONFIG_IDF_TARGET_ESP32C3 || CONFIG_IDF_TARGET_ESP32C6 || CONFIG_IDF_TARGET_ESP32H2 ||
        // CONFIG_IDF_TARGET_ESP32P4 || CONFIG_IDF_TARGET_ESP32C5)
